# DisconnectFromHost Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationHostedInfo..::..DisconnectFromHost Method
FabricationHostedInfo Class See Also
---
Disconnects the part from the host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void DisconnectFromHost()
```

Visual Basic
---
```text
Public Sub DisconnectFromHost
```

Visual C++
---
```text
public:
void DisconnectFromHost()
```

# See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace